[{"id": "20011", "coname": "Almetha M. Reed Place", "location": "West 190th Street between Davidson Avenue and Grand Avenue", "lat": 40.8641787, "long": -73.90119709999999, "borough": "Bronx", "loc_result": "W 190th St & Davidson Ave, Bronx, NY 10468, USA", "postal": "10468", "reason": "Almetha Melinda Reed was born to Matthew and Netha Polite, on October 4, 1928, in Savannah, Georgia where she attended the East Broad Elementary School and graduated from Beach-Kyler High School. She was baptized at an early age and after moving to New York City, was a member of Greater Central Baptist Church in Harlem for many years. Mrs. Reed later moved to The Bronx where she was a devoted member of the Cosmopolitan Church of the Lord Jesus for the last nineteen years of her life.\n        Mrs. Reed’s service to the community was quite extensive. She served as a member and a past President of the 52nd Pct. Community Council; a member of Community Board  No. 7; a member of the African American Caribbean Heritage Day Parade Council; a member of the Judicial Committee of Bronx County; a member of the Tremont Avenue Block Association; Organizer of the Davidson Avenue Block Association; a past President of her local Tenants Association; a principal organizer of the Green Thumb Project at the corner of Davidson Avenue and 190th Street; a member of the Committee of Friends of St. James Park; a member of Kingsbridge Manor Nieghborhood Association; a member of the United Committees of University of Heights and a member of the Star of Bethlehem Grand Chapter, Order of the Eastern Star.\nMrs. Reed died on March 15, 1999. She was survived by her husband Robbie and two daughters, Janice Weikers and Stephanie Colon.\n", "year": "2001"}, {"id": "20012", "coname": "Sonny Ressel Avenue", "location": "Avenue F between McDonald Avenue and Dahill Road", "lat": 40.6331689, "long": -73.9776328, "borough": "Brooklyn", "loc_result": "Avenue F & McDonald Ave, Brooklyn, NY 11218, USA", "postal": "11218", "reason": "William “Sonny” Ressel was born to Isadore and Ida Ressel on May 20, 1932, on New York City’s Lower Eastside. He attended Public School 4 and later graduated from Seward Park High School in that area.  In 1952, Sonny married the love of his life Rosalie (Ricki) Becker, and the couple moved to Ocean Parkway and Avenue F, in the Kensington area of Brooklyn, where they lived for more than forty years. While there, their marriage was blessed with a son named Stephen.\nSonny Ressel and his family were active members of the Ocean Parkway Jewish Center for many years and he became a member of the organization’s Board of Directors. During that time he helped with fund-raising, worked on many committees and became a full-time Community Activist.  Sonny Ressel also saw the need for a neighborhood association in Kensington to monitor quality of life issues. When the New Kensington Neighborhood Association (NKNA) was founded in 1988, he joined immediately. He helped with the organization’s recycling efforts before New York City had recycling laws. Ever vigilant, Sonny Ressel always called the Department of Transportation with information about defective street lights on any of the streets in the neighborhood. If he saw any irregularity in the area, such as clogged sewer drains, broken tree limbs or crime indicators, such as broken car windows, he made sure that NKNA addressed the problem and that the proper authorities were notified. On one occasion Sonny Ressel protested, along with local politicians and community activists to bring about the close of a business on McDonald Avenue that was a known pornography and prostitution storefront.\nIn 1994, Sonny Ressel became a Co-President of NKNA. His goal was to organize the community into an even more cohesive force to address quality of life issues and to maintain neighborhood decency standards. Sonny Ressel worked hand in hand with the 66th and 76th Police Precincts to protect the Kensington community until his death on February 9, 1999. He was survived by his wife Ricki, his son Stephen, and his sister Laura Edelstein.\nSonny Ressel was a devoted community activist who worked tirelessly, 24 hours a day, seven days a week, to achieve and maintain high quality of life standards for Kensington. \n", "year": "2001"}, {"id": "20013", "coname": "Alice Kornegay Way", "location": "Lexington Avenue between East 124th Street and East 131st Street", "lat": 40.8037062, "long": -73.9379199, "borough": "Manhattan", "loc_result": "Lexington Ave & E 124th St, New York, NY 10035, USA", "postal": "10035", "reason": "Alice Grace Wragg Kornegay was born in May of 1930 in Georgetown, South Carolina and came to Harlem at the age of 10 to live with relatives after her parents died.  She studied social work at Antioch College in Baltimore, Maryland, at Baruch College and the New School for Social Research.  She died on April 30, 1996, six days after the death of Richard, her husband of 47 years.  She was survived by two children, Barbara Brown of Harlem and Richard Wragg of The Bronx.  \n        Mrs. Kornegay was best known as the President of the Community Association of the East Harlem Triangle, Inc. which, under her direction, was responsible for the creation of many units of housing for the community bounded by Fifth Avenue, the East River, East 124th and East 132nd Streets.  Along with the Abyssinian Development Corporation, she also provided invaluable leadership in the development of plans for a Pathmark Supermarket on 125th Street.\n", "year": "2001"}, {"id": "20014", "coname": "La Lupe Way", "location": "East 140th Street between St. Ann’s Avenue and Cypress Avenue", "lat": 40.8081473, "long": -73.916591, "borough": "Bronx", "loc_result": "St Ann's Ave & E 140th St, Bronx, NY 10454, USA", "postal": "10454", "reason": "The following biographical information is excerpted from material provided by the Bronx Borough President’s Office and is also excerpted from a “La Lupe’s Grave” written by C.J. Sullivan and printed in the April 25 – May 1, 2001 edition of the New York Press.\n        Victoria Lupe Yoli was born in Santiago, Cuba on December 23rd in 1936, 1939 or 1940 (the year is uncertain). Later known as “La Lupe”, she was known worldwide as “The Queen of Latin Soul Music”.  Her musical style, honed in New York City after she left Cuba in 1963,  influenced the Afro-Caribbean music movement in the City.  She recorded 32 albums both as a soloist and in partnership with music legends such as Tito Puente and Mongo Santamaria.  La Lupe was also popularly known as La Yi Yi Yi.\n        La Lupe spent the final years of her life as an ordained evangelical minister, singing Christian music, while residing at 575 East 140th Street in The Bronx.  She died on February 29, 1992.  In 1999 she was posthumously inducted into the International Latin Music Hall of Fame.\n", "year": "2001"}, {"id": "20015", "coname": "American Veterans Memorial Pier", "location": "Bay Ridge Avenue from Shore Road to the Pierhead Line", "lat": 40.626361, "long": -74.008299, "borough": "Brooklyn", "loc_result": "Bay Ridge Ave, Brooklyn, NY, USA", "postal": null, "reason": "The 593-foot long 69th Street Pier, at the foot of Bay Ridge Avenue, was built in 1904 and was originally utilized as a ferry wharf and fishing pier. During World War I and World War II, nearby Fort Hamilton was used as a staging area for American troops who were to be shipped overseas to Europe and Asia. The 69th Street Pier, because of its proximity to Fort Hamilton, became an important embarkation point for these soldiers. When the wars ended, many of the returning soldiers reentered the United States by landing at the 69th Street Pier. It was here that they were welcomed home, honored and thanked for their service. For many, this pier was their first sight of American land upon returning home from their tours of duty.\nDuring peacetime, the pier remained a ferry wharf, for traffic to Staten Island, until the Verrazano Narrows Bridge was opened in 1964. Afterwards, it fell into disuse, and disrepair, and was for a time fenced off and abandoned. In 2000, the pier was reconstructed and reopened as a recreation area. Community Board #10 recently unanimously approved and recommended a plan to rename the 69th Street Pier “American Veterans Memorial Pier” in honor of the many American soldiers who embarked and arrived there during World War I and World War II.\n", "year": "2001"}, {"id": "20016", "coname": "Josephine Caminiti Playground", "location": "102nd Street, Corona Avenue and Alstyne Avenue", "lat": 40.7442849, "long": -73.86178919999999, "borough": "Queens", "loc_result": "102nd St & Corona Ave., Queens, NY 11368, USA", "postal": "11368", "reason": "Josephine Caminiti, nee Verderosa, was born in Corona, Queens on July 16, 1931, to Michael and Nancy Verderosa. Josephine Caminiti lived her entire life in Corona Heights, attending Public School 14 and later graduating from Newton High School. Her first marriage left her widowed while still in her thirties and she became a single parent to her three daughters. In 1978 she married Anthony Caminiti and this union lasted until her death. \nJosephine Caminiti truly loved Corona Heights and was a strong community activist. She was a member of the Northside Democratic Club for forty years, serving a term as the club’s President, and for the last six years of her life served as Democratic District Leader in the 34th Assembly District. Josephine Caminiti was also a member of Community Planning Board No. 4 for seventeen years. She served on the Advisory Committee of the Donald Savio Adult Home in Corona, was an active member of the Corona Taxpayers Civic Association, a Board Member of the Corona Community Development Corp., and participated in the after school programs at P.S. 14, P.S. 19, I.S. 61, and St. Leo’s Parochial School where she founded a library. In addition, Josephine Caminiti was a member of the Executive Board of the PTA at P.S. 19, participated in the Queens Borough Society for the Prevention of Cruelty to Children and worked as a School Aide for the Board of Education for twenty-six years.\nJosephine Caminiti, much loved by her Corona Heights community, died on September 23, 1994. She was survived by her husband Anthony, three daughters, Virginia, Nancy and Rita, and six grandchildren. Because of her many years of devoted service to her community, and its children, it is fitting that the existing playground in her beloved Corona Heights neighborhood, bounded by 102nd Street, Corona Avenue and Alstyne Avenue, be renamed in her honor.\n", "year": "2001"}, {"id": "20017", "coname": "Kathy Kiernan Way", "location": "Simonson Avenue between Forest Avenue and Richmond Terrace", "lat": 40.6256416, "long": -74.1531266, "borough": "Staten Island", "loc_result": "Simonson Ave & Forest Ave, Staten Island, NY 10303, USA", "postal": "10303", "reason": "Kathy Kiernan was born on October 29, 1948.  Although she lived in Brooklyn, she called Staten Island her home for twenty years.          Kathy Kiernan knew from personal experience the devastation of drug abuse.  She struggled, but overcame her adversities, to move forward with her life and become a role model for all.  She believed that everyone could be helped.  She often put her own personal needs aside to help those who needed her help.  Her friends and co-workers at Daytop Village have stated that “…nobody did more for Staten Islanders than Kathy Kiernan.  She saved lives.” \n        Kathy Kiernan worked at Daytop Village Staten Island Outreach for thirteen years including serving as Director for ten of those years and was Co-Chair of the Staten Island Committee on Alcoholism and Substance Abuse (SICASA).    She was also a member of the Mid-Island Rotary Club which she served as a Vice-President. In 1995 she formed Project Connect, a teen forum co-sponsored by the Rotary Club and SICASA.\n        She died on December 11, 1998 survived by her husband John, son Kevin, grandson Kevin Jr. and sisters Jean and Mary.  In recognition of her accomplishments and contributions to the people of Staten Island, this proposed local law would name the street adjacent to Daytop Village Staten Island Outreach as Kathy Kiernan Way.\n", "year": "2001"}, {"id": "20018", "coname": "Veterans of Foreign Wars Place", "location": "136th Street between the Horace Harding Expressway eastbound service road and 61st Road", "lat": 40.817589, "long": -73.9470202, "borough": "Manhattan", "loc_result": "W 136th St, New York, NY, USA", "postal": null, "reason": "This street renaming was requested by Veterans of Foreign Wars Post 3427 and the Cedar Grove Civic Homeowners Association, Inc.  It is intended to serve as a tribute to the many veterans, men and women, who gave of themselves to protect freedom and the American way of life in military actions throughout the world.  ", "year": "2001"}, {"id": "20019", "coname": "King Stephen of Hungary Way", "location": "East 82nd Street between York Avenue and Third Avenue", "lat": 40.77334820000001, "long": -73.9490175, "borough": "Manhattan", "loc_result": "York Ave & E 82nd St, New York, NY 10028, USA", "postal": "10028", "reason": "King Stephen was born Vajk, in 977 AD, son of Grand Prince Geza of the Magyars. Dedicated to the welfare of his people and committed to the strengthening of his people through intellectual and moral means, Geza invited Christian missionaries of the reform Benedictines from Cluny, France into his realm. As an example to his people, he had missionaries instruct his son and baptize him under the name Istvan or Stephen.\nStephen succeeded his father as Grand Prince of the Magyars in 997. Recognizing the energetic and responsible leadership of this young ruler on the eastern flank of Europe, Pope Sylvester II in 1000 granted Stephen the title of King of Hungary and sent papal emissaries to him with a crown symbolic of the new title and a double barred archbishop’s cross indicative of the establishment of a separate church organization for the newly independent nation. Since then, this crown and cross have become the radical confirmation of legitimate constitutional authority in Hungary and a rallying symbol of national identity and strength during the occupations of the Turks, the Austrians, the Nazis and the Soviets. The coronation of Stephen also focused Hungary toward the west.\nStephen organized the secular and religious life of Hungary in a manner which endures, with slight change, to the present. He invited foreigners, especially those who were refugees from oppression, into Hungary so that they could each enrich it with their customs, languages, and creativity. In this fashion, Stephen anticipated the “melting pot” concept of society, as we know it today. In his personal life, Stephen lived as an outstanding example of a husband and a father to such a extent that he and his son Prince Imre, or Emeric, were recognized as Catholic saints, and his wife, Queen Gesilla, was recognized as a Catholic blessed. Outstanding for his service to the poor and destitute and stalwart in using his political power for the defense of the powerless, Stephen shortly before he died, officially offered his crown to God as the only true ruler. \nDecember 20, 2000 marked the millennium of the coronation of Stephen as the first monarch of the Magyars (Hungarians). In recognition of this event, Pastors of the Hungarian churches of New York City have requested the permanent renaming of East 82nd Street, between York Avenue and Third Avenue, to “King Stephen of Hungary Way”.  This will include the East 82nd Street, between First and York Avenues, location of St. Stephen’s Hungarian Church.\n", "year": "2001"}, {"id": "200110", "coname": "Msgr. John J. Considine Square", "location": "the intersection of East 241st Street and Martha Avenue", "lat": 40.901923, "long": -73.86559629999999, "borough": "Bronx", "loc_result": "Martha Ave & E 241st St, Bronx, NY 10470, USA", "postal": "10470", "reason": "Monsignor John J. Considine was born in Manhattan in 1913 and grew up in Greenwich Village in a family of seven children.  He attended St. Veronica’s School, Cathedral Boys High School and Cathedral College, before entering St. Joseph’s Seminary in Dunwoodie, New York.  He was ordained on September 20, 1936 and sent to The Catholic University of America in Washington, D.C. for graduate studies.  After earning a Master’s Degree in Church History he received his first parish assignment at Our Lady of Mercy in the Bronx.  He taught Church History at Cathedral College from 1941 to 1951 and was Dean of Studies there from 1953 to 1961.  He was named a Monsignor in 1961 and reassigned as principal of the new Msgr. Farrell High School in Staten Island.\nHe was pastor of St. Barnabas parish in the Bronx for 21 years, from 1965 to 1986, then became pastor emeritus and a senior priest of the Archdiocese with residence at Cardinal Spellman High School.  Commenting on the tenure of Monsignor Considine, Monsignor Francis X. Toner said, “He took his daily Masses, he did funerals, weddings.  The old timers all wanted him for their funerals, for the weddings of their children and the baptisms of their grandchildren. He was always in great demand and the people loved him.”\nHe was survived by a sister, Veronica Carey, of Dumont, New Jersey. \n", "year": "2001"}, {"id": "200111", "coname": "Chief Charles A. Joshua Plaza", "location": "the intersection of Fulton Street, Ralph Avenue and MacDougal Street", "lat": 40.67887959999999, "long": -73.9217456, "borough": "Brooklyn", "loc_result": "Fulton St & Ralph Ave, Brooklyn, NY 11233, USA", "postal": "11233", "reason": "Chief Charles Adebowale Joshua was born in New York City on July 24, 1924, the son of Samuel and Ethel Joshua.          After graduation from Haaren High School in New York City and the POH Institute, he began work as a machine operator and supervisor with the Independent Container Company (1942-56).  After working for a year (1956-57) as a postal clerk with the United States Postal Service, he began a 13 year career with the United States Army.  He also attended the United States Army Adjutant General School, majoring in Business Administration.  In 1974, Chief Joshua entered the Social Work Studies Program at Adelphi University and, in 1981, he began the Off-Campus B.S./M.B.A. Program through California Western University.  \nSince 1973, Chief Joshua was employed as Executive Director of the Central Brooklyn Coordinating Council, Inc.   At the Council, he worked to stimulate cooperation among community agencies, providing the Council with professional leadership.  Chief Joshua was involved with many community groups including the Bedford Stuyvesant/Crown Heights HIV Care Committee, the Bedford Stuyvesant Youth AIDS Prevention Committee, the Board of Directors of the Literacy Assistance Center, the National Association of Black Social Workers, the Board of Directors of the John The Baptist Community Center, the New York City Task Force on Adolescent Pregnancy and many others.  He received many awards for his community service including recognition from the Brooklyn Borough President, from several Mayors and then-Governor Cuomo.\nHe was survived by his wife Anita, daughter and son-in-law Sharon and Kenneth Robinson, two grandchildren Kenneth DeShawne and Sharkena Robinson, one great-grandchild Channell Robinson and two sisters Mary L. Joshua-Johnson and Chief Sybil A. McCarthy.\n", "year": "2001"}, {"id": "200112", "coname": "P.O. Joseph Garcia Place", "location": "Clinton Avenue between Prospect Avenue and Henderson Avenue", "lat": 40.6901285, "long": -73.9682115, "borough": "Brooklyn", "loc_result": "Clinton Ave, Brooklyn, NY, USA", "postal": null, "reason": "Joseph Robert Garcia was born on August 25, 1940 at St. Vincent’s Hospital on Staten Island.  He graduated from St. Peter’s Elementary School and from St. Peter’s Boys High School and attended Staten Island Community College.  He worked for Proctor and Gamble for two years and then applied to the Police Academy.  Joseph Garcia was drafted into and served in the United States Army as a Military Policeman in Korea.  After his discharge, Joseph Garcia joined the New York City Police Department.  He married Michele McQuillan from the New Dorp section of Staten Island on October 5, 1968.        \nJoseph Garcia died in the line of duty on January 20, 1975 as a result of wounds received while in pursuit of two robbery suspects.  He is survived by his wife Michele, two sisters and a brother.  On October 18, 1980, the Police Athletic League facility located at 392-398 Jersey Street on Staten Island was dedicated in his name.  \n", "year": "2001"}, {"id": "200113", "coname": "Rev. William E. Gardner Place", "location": "31st Avenue between 100th Street and 101st Street", "lat": 40.7610126, "long": -73.8691516, "borough": "Queens", "loc_result": "100th St & 31st Ave, Queens, NY 11369, USA", "postal": "11369", "reason": "The following biographical material was provided by the Gardner family.\nWilliam E. Gardner, Sr. was born to Moses and Carrie Gardner, on February 26, 1907, in New Smyrna, Florida. He was baptized at an early age into the fellowship of the Elizabeth Baptist Church in Arcadia, Florida. Mr. Gardner received his elementary education in the public schools of Arcadia and later graduated from Morehouse Academy in 1927. In June 1931, he was graduated from Morehouse College, with an A.B. degree, where he had an outstanding record as both an athlete and a scholar. In 1949, Mr. Gardner received a BD degree from Virginia University and in 1965 he was awarded a Doctor of Divinity degree from Virginia Union University.  Mr. Gardner also studied at Drew University, Columbia University’s Teachers College and Union Theological Seminary.  \nIn 1936 he married Bessie Faust and they had two children Dr. William E Gardner 2nd, and Zenobia Gardner Earl.  During the years 1942 to 1945 Reverend Gardner served in the United States Army as a chaplain, attaining the rank of Captain.\nAfter completing college, Reverend Gardner was a High School Principal for five years in several cities in Florida. He was also the Minister of First Baptist Church, Arcadia, Florida, Harmony Baptist Church, Lakeland, Florida and First Baptist Church in Williamsburg, Virginia.  In 1950 he assumed the pastorate of First Baptist Church, East Elmhurst, New York.  During his tenure as pastor of First Baptist the membership grew from less than 200 to over 2,200 members. A beautiful new church costing more than half a million dollars was built.\nReverend Gardner served his church and his community in many capacities during his lifetime. He was a past president of the Baptist Ministers Conference of Greater New York and Vicinity, a member of the Advisory Committee of the local N.A.A.C.P., Chairman of the Board of Directors of the Baptist Educational Center of Brooklyn and Long Island, and he was the New York representative on the Ministerial Benefit Board of the National Baptist Convention U.S.A., Inc.  Also among Reverend Gardner’s accomplishments was his selection as “Distinguished Institute Leader and Preacher” at Virginia Union University and Bishop College and his selection in 1973 as Alumni of the Year by Virginia Union University.  Reverend Gardner served as a member of the 250th Anniversary Committee of Colonial Williamsburg, Virginia and published several articles on the Negro in Colonial times.\nReverend Doctor William E. Gardner, Sr. died in June 1974.  He was survived by his wife, Mrs. Bessie F. Gardner; his son and daughter, and two grandchildren. In recognition of his many years of devoted service to his church and to the community of Queens, it is fitting that 31st Avenue, between 100th and 101st Streets in East Elmhurst, the site of his beloved First Baptist Church, be named “Rev. William E. Gardner Place” in his honor.\n", "year": "2001"}, {"id": "200114", "coname": "Rev. Frederick Sutter and Rev. Carl Sutter Corner", "location": "Beach Street and St. Paul's Avenue", "lat": 40.630015, "long": -74.0817381, "borough": "Staten Island", "loc_result": "Beach St & St Pauls Ave, Staten Island, NY 10304, USA", "postal": "10304", "reason": "Reverend Frederic Sutter and Reverend Carl Sutter were a father and son team that helped to guide the fortunes of the Trinity Lutheran Church at the Stapleton community of Staten Island for more than 71 years.\nReverend Frederic Sutter, one of the first graduates of Wagner College (Rochester, NY), became pastor of Trinity Lutheran Church in 1907. Shortly after his arrival, the congregation decided that a new church was needed. The responsibility of building the new church fell to Reverend Sutter. He guided the project into construction in 1913 and in 1914, the present edifice, an imposing Gothic structure of yellow brick located on Beach Street, was dedicated. Trinity Lutheran Church grew under Reverend Sutter’s leadership and by 1929 was believed to have 3,000 baptized members and 1100 communing members and probably had the largest Protestant membership on Staten Island at that time. \nNear the end of World War I, Reverend Sutter’s alma mater, Wagner College in Rochester, New York, reached out to him for help finding a new location for the school. Through his efforts, Wagner College relocated to Grymes Hill on Staten Island. Reverend Frederic Sutter was succeeded as pastor at Trinity Lutheran Church in 1964 by his son, Reverend Carl Sutter, who had served under him for more than three decades.\nRev. Carl Sutter, known as “Pastor Carl”, was born in Hudson, New York and was brought to Staten Island, at seven months of age, when his father accepted the pastorate at Trinity Lutheran Church. He attended Public Schools 14 and 15 in Tompkinsville and Wagner Preparatory School. In 1929 he received a Bachelor’s degree in liberal arts from Wagner College. Carl Sutter then took a job on Wall Street while continuing his education at New York University Graduate School. After the stock market crashed later that year, Carl Sutter decided to leave the business world and follow in his father’s footsteps in the ministry. He enrolled at Princeton University and, a year later, transferred to his father’s alma mater, Lutheran Theological Seminary in Philadelphia. Soon after his ordination in 1933 he returned to Staten Island to join his father at Trinity Lutheran Church. He was to spend his entire career as a clergyman there. In 1936, Dr. Sutter married his childhood sweetheart, the former Eleanor Koehler of Stapleton and moved to Emerson Hill.\nRev. Sutter was considered by many as a pioneer in improving community relations on Staten Island. He helped organize the Booker T. Washington Center during World War II to look after the needs of some 7000 African-American troops stationed in Stapleton who were denied access to the local United Service Organization (USO). Also during the War, Rev. Sutter, who was fluent in German, served as the chaplain for German prisoners of war at the former Halloran Hospital. He often played a key role in the Staten Island Interfaith relations, having served as chairman of the building committee for The nondenominational Bethel Community Church in Tompkinsville. Also, for several years, he orchestrated a series of Holy Week Services that brought together members of Protestant and Catholic churches in the Stapleton/Tompkinsville community.  Rev. Sutter served as president of the Staten Island Council of Churches and held a key position in what is now the Metropolitan Synod of the Lutheran Church of America. During the 1960’s, Rev. Sutter oversaw the construction of the $1,000,000 Trinity Lutheran School.  He delayed his retirement seven years, until 1978, to ensure that the debt on the school was paid in full.\nReverend Carl Sutter died in October 1998 at the age of 91. He was survived by two sons, Frederic and Carl Richard, three grandchildren and one great-granddaughter. Staten Island County Clerk Mario J. Esposito, who served on the Wagner College Board of Trustees with Reverend Carl Sutter for 12 years, said in an interview that he considered Reverend Frederic Sutter and Reverend Carl Sutter the “backbone” of the College.  “Both were friendly, community-minded.  They set the standards and the goals. They were men of integrity.”  In recognition of their contributions to Wagner College, Trinity Lutheran Church, the Borough of Staten Island and the City of New York, it is fitting that the northeast corner of Beach Street and St. Paul‘s Avenue, the site of Trinity Lutheran Church, be named “Rev. Frederic and Rev. Carl Sutter Corner” in their honor.\n", "year": "2001"}, {"id": "200115", "coname": "Sylvia Simowitz Way", "location": "89th Road between 130th Street and 132nd Street", "lat": 40.6994407, "long": -73.8210964, "borough": "Queens", "loc_result": "89th Rd & 130th St, Queens, NY 11418, USA", "postal": "11418", "reason": "Sylvia Simowitz was born in 1919.  Throughout her life she gave unsparingly of her time and energy to the various community organizations with which she was associated.  These community organizations included: Therapeutic Communities of America, Queensboro Council of Social Welfare, Association of Voluntary Agencies on Narcotic Treatment, Queens Transitional Services and the Queensboro President’s Council on Substance and Alcohol Abuse.  In 1984, at the New York State Fair in Syracuse, New York, Sylvia Simowitz was cited as one of the Empire State Women of the Year for her leadership in the development of drug abuse treatment services.\n        In 1966, Sylvia Simowitz joined Samaritan Village as a volunteer assistant to its founder, Father Damian Pitcaithly.  She was involved in all aspects of Samaritan Village from improving the management of the kitchen, to counseling clients’ family members, to representing Samaritan Village before state and federal agencies.  After holding several administrative positions at Samartian Village, she was named First Executive Vice-President.  She provided 32 years of inspiring leadership throughout the Samaritan Village organization on its Board of Directors as it grew to a network of 13 locations providing services to 1,500 men and women.\nOn October 8, 1998, following the death of Sylvia Simowitz, Samaritan Village dedicated its flagship facility located at 130-15 89th Road in Richmond Hill, Queens in her memory.\nShe volunteered in Beth Israel Hospital North, Mary Manning Walsh Nursing Home and New York Hospital and was a long-time member of Hadassah.\nThe Sewarol Park High School Alumni Association honored Sylvia Simowitz for her lifetime of achievements.\n", "year": "2001"}, {"id": "200116", "coname": "John Cifichiello Way", "location": "Mace Avenue from Bronxwood Avenue to Williamsbridge Road", "lat": 40.863104, "long": -73.8616621, "borough": "Bronx", "loc_result": "Mace Ave & Bronxwood Ave, Bronx, NY 10467, USA", "postal": "10467", "reason": "John Cifichiello, the son of Italian immigrants Vito and Rosa Cifichiello, was born at home in a New York City Greenwich Village apartment on August 24, 1906. At a young age his family, which grew to four boys and four girls, moved to the Fordham section of The Bronx where the family prospered and eventually bought their own home on Crotona Avenue. John worked in the printing trade and married Caroline Ciani, with whom he raised a son John and a daughter Carolyn.  During World War II, he served in the United States Navy, in Ireland and England, and upon his discharge began a career with the United States Postal Service.\nAfter the war John Cifichiello was a member, and later Commander, of the Catholic War Veterans, escorting veterans to Mass each Sunday at the Kingsbridge VA  Hospital.  He was also active in Mt. Carmel Church’s Holy Name Society and the St. Vincent DePaul Society of St. Lucy’s Church and was a past president of the St. Lucy’s Church Senior Citizens Association.  Mr. Cifichiello also served as a member of Community Board #11, serving as the Chair of the Parks Committee for many years.  He was a long-term member of the Red Cross, participating and organizing numerous blood drives for St. Lucy’s Church, and was also a past member of the Catholic Guild for the Blind.  Mr. Cifichiello served with the Pelham Parkway Little League for over twenty years, first as a coach and then as President. Upon retiring from the Post Office in 1975, he began as a volunteer at the New York Botanical Gardens where he continued to serve until his death.  He was proud to always march in the annual Bronx Columbus Day Parade.\nJohn Cifichiello passed away on October 19, 2000.  He was survived by a son, John, a daughter, Carolyn; two brothers, Neal and Fred; a sister Josephine Ardizzone, and six grandchildren. In recognition of his service to The Bronx community it is fitting that Mace Avenue, between Williamsbridge Road and Bronxwood Avenue, where he lived for many years, be named “John Cifichiello Way”.\n", "year": "2001"}, {"id": "200117", "coname": "Georgina Soccodato Way", "location": "Morris Park Avenue from White Plains Road to Hunt Avenue", "lat": 40.8465335, "long": -73.8598306, "borough": "Bronx", "loc_result": "Morris Park Ave, Bronx, NY, USA", "postal": null, "reason": "Georgina Soccodato, a native New Yorker, was born on July 18, 1946. She was educated in the City’s public schools and graduated from the High School of Fashion Industry in Manhattan. Mrs. Soccodato attended New York University where she earned a para-professional certificate in education, and later worked with elementary school children in the Hunts Point district. She loved the Morris Park area of The Bronx and immersed herself in that community’s activities when she moved there in 1976.\nAfter opening a clothing store in Morris Park, Ms. Soccodato became vice-president of the Morris Park Business Association, coordinator of the Morris Park Civilian Patrol and served for seventeen years as the coordinator of The Bronx Columbus Day Parade. She also became Executive Director of the Morris Park Local Development Corporation, which works to maintain the viability and stability of the area’s commercial strip. This organization also sponsors street fairs, youth soccer programs, youth language classes, seasonal street activities and senior recreational and educational projects.\nMs. Soccodato also served as the chairwoman of the Jacobi Medical Center Advisory Board, was a member of the Community Advisory Board of the Albert Einstein College of Medicine and the Jack D. Weiler Hospital, Technical Advisor and Board Member of the Eastchester Road, Westchester Square, Throggs Neck, City Island, and the Morris Park/Williamsbridge Business Associations, Director of the Morris Park Senior Center, and Political Action/Publicity Chairperson for the Northeast Bronx Coalition. She received many honors from elected officials, agencies and civic organizations including Mayor Koch, Bronx Borough Presidents Simon and Ferrer, former City Council President Stein, the New York City Department of Business Services, the Bronx Neighborhood Conference, Children Are Precious, the Morris Park Merchants Association, the Bronx Municipal Hospital Center, and the Select Women’s Assistance Network\nGeorgina Scoddatto passed away on April 19, 2000. She was survived by two brothers, Ron and Richard Kunick, and a sister Darlene Paruru. In recognition of her many years of devoted community service, it is only fitting that Morris Park Avenue, between White Plains Road and Hunt Avenue, the site of the Morris Park Local Development Corporation, be named “Georgina Soccodato Way” in her honor.\n", "year": "2001"}, {"id": "200118", "coname": "Rev. David M. Cory Place", "location": "Avenue T between East 14th Street and East 15th Street", "lat": 40.6009889, "long": -73.9577644, "borough": "Brooklyn", "loc_result": "E 14th St & Avenue T, Brooklyn, NY 11229, USA", "postal": "11229", "reason": "Rev. David M. Cory was born on February 10, 1903 in Manhattan.  He graduated form Columbia University in 1923 and from the New College of Edinburgh, Scotland in 1926.  He received a Masters Degree from Columbia University and a doctorate in theology form Union Theological Seminary in 1931.\n        At his retirement in 1990 form the Homecrest Presbyterian Church at Avenue T and East 15th Street in Sheepshead Bay, Brooklyn after fair decades of service, Dr. Cory was the oldest active Presbyterian pastor in the United States.  While serving at Homecrest Church, he also served as pastor of the Beverly Presbyterian Church at Beverly Road and East 8th Street in Flatbush, Brooklyn.  He also served for 29 years as pastor of the Cuyler Presbyterian Church at 360 Pacific Street in Boerum Hill, Brooklyn.\n        As a young man, he was beaten while accompanying workers passing out union literature.  That beating caused the permanent impairment of the sight in his left eye.  In 1931, he was defeated as the Socialist Party candidate for the State Assembly.  He also ran for Borough President and Congress.\n        In the 1930’s, Mohawk Indians who lived on a reservation near Montreal, Canada were brought to New York City to be ironworkers for the construction of the Triborough Bridge. Many lived in Brooklyn to be close to the ironworker’s union headquarters and attended Cuyler Presbyterian Church on Sundays.  Dr. Cory learned to speak their Monhawk-Oneida language and helped to prepare an Indian hymn.\nFor many years, Rev. Cory was President of the Iceberg Athletic Club, whose members annually participate in mid-winter swims in the Atlantic Ocean.  He also painted landscapes and read widely about history.\n        Dr. Cory was survived by his wife of 40 years, Elsie, and his sons Daniel, David, John, and his daughter Mina.\n        The street to be named is outside of the Homecrest Presbyterian Church.\n", "year": "2001"}, {"id": "200119", "coname": "Monsignor Dorney Way", "location": "Richmond Terrace between Wall Street and St. Peter's Place", "lat": 40.7060361, "long": -74.0088256, "borough": "Manhattan", "loc_result": "Wall St, New York, NY, USA", "postal": null, "reason": "Monsignor James J. Dorney was born on July 12, 1932.  He graduated from St. John’s Elementary School in The Bronx in 1946, Cathedral College Prep School in Manhattan in 1952, and both St. Joseph’s Seminary and Catholic University in 1958.  He was ordained a Roman Catholic priest on May 31, 1958.\n        Following completion of his post-graduate studies at Catholic University in Ponce, Puerto Rico, Monsignor Dorney served from 1958 to 1965 as an Associate Pastor at Our Savior Church in The Bronx.  He then served, from 1965 to 1966, as an Associate Pastor at St. Agnes Church in Manhattan.  From June 1966 to July 1974, Monsignor Dorney was an Associate Pastor at St. Elizabeth’s Church in the Washington Heights section of Manhattan.  From July 1974 to September 1976 he was an Associate Pastor at St. Paul’s Church in Congers, New York.\n        Monsignor Dorney began a quarter century of continuous service to Staten Island Catholics with his designation as Associate Pastor of Saint Margaret Mary’s Church where he served from September 1976 to September 1983.  From October 1983 to July 1986 he served as Administrator, and since July 1986 as Pastor, of St. Peter’s Church.\n        Monsignor Dorney also serves as a Chaplain with the New York City Police Department and has been a Command Chaplain with the United States Coast Guard since July 1996.\n        Now 69 years of age, he continues to serve the Roman Catholics of Staten Island, the Police Department and the Coast Guard.\n", "year": "2001"}, {"id": "200120", "coname": "Nick Bruno Way", "location": "Maple Parkway between Walloon Street and Netherlands Avenue", "lat": 40.632493, "long": -74.1563231, "borough": "Staten Island", "loc_result": "Maple Pkwy & Walloon St, Staten Island, NY 10303, USA", "postal": "10303", "reason": "Nick Bruno was born on January 7, 1940 in the Mariners Harbor section of Staten Island.  He graduated from Public School 44, where he excelled in basketball, and, in 1957, from Port Richmond High School where he was both a baseball and a basketball star.  In 1958, while playing on the same baseball team as a young Joe Torre, Nick Bruno won the Lou Gehrig Award.\n        Nick Bruno went on to attend Iowa State University on a basketball scholarship and after his 1961 graduation, pursued post-graduate studies at Iowa State University but left to play minor league baseball in the San Francisco Giants’ farm system.\n        In September 1963 he returned to Public School 44 where he would teach for 32 years.  He ran after school sports programs for the community’s young people for many years at Public School 44.  He retired in June 1995 and died on May 8, 2000.  In recognition of both his many years of service to the youth of Staten Island and his athletic prowess, Nick Bruno was elected to the Staten Island Hall of Fame.\n", "year": "2001"}, {"id": "200121", "coname": "The Greater Bright Light Place", "location": "Sutter Avenue between Hemlock Street and Crescent Street", "lat": 40.6732872, "long": -73.86852200000001, "borough": "Brooklyn", "loc_result": "Hemlock St & Sutter Ave, Brooklyn, NY 11208, USA", "postal": "11208", "reason": "The Greater Bright Light Baptist Church was organized in 1974 and, since 1990, it has been located at 1320 Sutter Avenue in Brooklyn.  Providing outreach to the community’s children, the infirm, the aged and the homeless, The Greater Bright Light Baptist Church has implemented programs such as an Early Learning Center and an After School Program for children.  In an effort to feed those in the community who are unable to provide for themselves, the Church also operates a Food Program.  \n        In addition, The Greater Bright Light Baptist Church operates a Home Care Program for people with ambulatory limitations, a Homeless Shelter Program, Senior Programs and various other community outreach programs.\n        Under the leadership of Reverend H. Devore Chapman, The Greater Bright Light Baptist Church continues to play a pivotal role in the life of the community.\n", "year": "2001"}, {"id": "200122", "coname": "Officer Michael Buczek Avenue", "location": "Edgecombe Avenue between Jumel Place and Amsterdam Avenue", "lat": 40.84047229999999, "long": -73.93531399999999, "borough": "Manhattan", "loc_result": "Jumel Pl & Edgecombe Ave, New York, NY 10032, USA", "postal": "10032", "reason": "Police Officer Michael Buczek was born to Ted and Josephine Buczek, in Paterson, New Jersey, on August 19, 1964.  At his birth the Buczek family lived in Wayne, New Jersey and he later attended Holy Cross Elementary School and DePaul Catholic High School there.  After high school, Michael attended Ramapo College in Mahwah, New Jersey. \n        Michael Buczek became a New York City Police Officer on July 8th 1985 and after training at the Police Academy was assigned to the 34th Precinct in Upper Manhattan.  Officer Buczek was designated to patrol the area of West 155th Street to West 165th Street, the busiest part of the Precinct.  On October 13, 1988, at 9:45 P.M., Police Officer Buczek and his partner, Police Officer Joseph Barbato, responded to a call on West 161st Street and Broadway.  After completing their assignment, the Officers saw two suspicious men loitering in the building.  When approached by the Officers, the two men fled.  The Officers followed them, shots were fired and Police Officer Buczek was wounded in the chest.  Officer Barbato returned the fire and then remained with his fallen partner, rendering aid to him.  Police Officer Buczk was taken to Columbia Presbyterian Hospital where he died a short time later.\n        Police Officer Buczek was survived by his father Ted, who now resides in Florida his brother, Walter, his sister-in-law, Janet and his sister, Mary Jo.  Public School 48 located at West 186th Street and Broadway is dedicated in Police Officer Buczek’s name.  Since the loss of their son, the Buczek family has dedicated themselves to contributing to the community that their son served by creating the Buczek Little League, to help the children and families of Northern Manhattan.  The community of Northern Manhattan commemorates the contributions of Michael Buczek and his family by celebrating a religious service in his memory every year on October 13th.  In recognition of Michael Buczek’s ultimate sacrifice, it is fitting that Edgecombe Avenue, between Jumel Place and Amsterdam Avenue, the location of the 34th Precinct, be named “Officer Michael Buczek Avenue” in his honor.\n", "year": "2001"}, {"id": "200123", "coname": "Bishop J. Arthur Jones Place", "location": "Jefferson Place between Boston Road and Franklin Avenue", "lat": 40.8336195, "long": -73.9005624, "borough": "Bronx", "loc_result": "Franklin Ave & Jefferson Pl, Bronx, NY 10456, USA", "postal": "10456", "reason": "Bishop J. Arthur Jones began to teach Sunday School at the age of 14.  By the time he was 18 he felt his call to the Ministry and, after seven years of labor as an Evangelist field, he began his pastorage.\n        The first Bible School attended by Bishop J. Arthur Jones was the Moody Bible Institute in Chicago, Illinois.  He went on to spend three years at Columbia University, studying in the Department of Religious Education and continued his studies with three years at the Berea Bible Institute and Seminary.  Bishop J. Arthur Jones also studied both the Hebrew Classics and the Federal Bureaucracy at Herbert H. Lehman College of the City University of New York.\n        Bishop Jones was the founder and served for over 30 years as the Pastor of Temple Emmanuel on Boston Road in The Bronx.  At the time of his death, he was also serving as the head of the United Church of God in Christ in the United States of America and Africa.  \n        A prolific writer, composer, singer and pianist, Bishop Jones was motivated by the Holy Spirit to write “The Defender of My Faith” while recuperating from illness.  Later, while studying for his Ph.D. degree, he was again motivated by the Holy Spirit.  He wrote “The Revelation of the Kingdom of God” as a manual for Christians seeking guidance and insight into their beliefs.\n        The Bronx Shepherds Restoration Corporation, of which he was a founding member, honored Bishop Jones by dedicating the housing development at 1360 Clinton Avenue as the “J. Arthur Jones Apartments”.\n", "year": "2001"}, {"id": "200124", "coname": "Milt Hinton Place", "location": "113th Avenue between Marne Place and 175th Street", "lat": 40.693688, "long": -73.776251, "borough": "Queens", "loc_result": "175th St & 113th Ave, Queens, NY 11433, USA", "postal": "11433", "reason": "Milton “Milt” Hinton was born on June 23, 1910 in Vicksburg, Mississippi. Mr. Hintons’s parents separated when he was an infant and his mother moved to Chicago where he joined her, after living with relatives, when he was nine years old. With his mother’s encouragement he began studying the violin. In 1929, Mr. Hinton taught himself to play the string bass because opportunities for violinists were limited, as symphony orchestras were not yet hospitable to Black musicians.\nAfter working for several years with a Jazz band in the Chicago area, Mr. Hinton was hired by the Cab Calloway Band in 1936.With the Calloway band, he became one of the first Jazz bassists to be featured on records as a soloist. During his 60 year career, Mr. Hinton, nicknamed the “The Judge”, performed and recorded with many legendary musicians including Count Basie, Duke Ellington, Louis Armsrong, Benny Goodman, Erskine Tate, Art Tatum, Jabbo Smith, Eddie South, Zutty Singleton, Cab Calloway, Eubie Blake, John Coltrane, Quincy Jones, Wynton Marsalis, Branford Marsalis, Paul McCartney, Andre Kostelanetz, Guy Lombardo, Frank Sinatra, Bing Crosby, Billy Holiday, and Barbara Streisand. He became one of the most recorded artists in history as estimates of the records and albums he recorded range from 600 to well over 1,000.\nAt the height of his popularity Milt Hinton entertained Presidents and dignitaries at the White House, served as chairman of the International Society of Bassists, The National Association of Jazz Educators, the Jazz Panel of the National Endowment for the Arts and held charter memberships in the Duke Ellington Fellowship at Yale University and the Newport Jazz Festival Hall of Fame. He received many honors during his lifetime including honorary doctorates from DePaul University, Hamilton College, Skidmore College, Trinity College and William Patterson College of the State of New Jersey. Mr. Hinton also received awards from Esquire and Downbeat Magazines, “The Satchmo Award” from the Saratoga Jazz Society, “The Benny Carter Award” from the American Federation of Jazz Societies, “The Living Treasure Award” from the New York Chapter of the National Academy of Recording Arts and Sciences, and the “Keys to the City” of more than a dozen cities.\nMilt “The Judge” Hinton died on December 19, 2000 in Queens where he had been a pillar of the St. Albans community for many years. He was survived by his wife Mona; a daughter, Charlotte Morgan; and a granddaughter. Because of his outstanding contributions to the Jazz music of the Twentieth Century, and his lasting inspiration to his community, it is fitting that 113th Avenue, between Marne Place and 175th Street in St. Albans, where he lived for more than a quarter of a century be named “Milt Hinton Place” to honor this musical legend. \n", "year": "2001"}, {"id": "200125", "coname": "Harry Douglas Way", "location": "Sidway Place between Selover Road and Farmers Boulevard", "lat": 40.6811067, "long": -73.76117719999999, "borough": "Queens", "loc_result": "Sidway Pl & Farmers Blvd, Queens, NY 11434, USA", "postal": "11434", "reason": "Harry M. Douglas lived on Sidway Place in southeast Queens and at his death, on June 5, 1999, had provided almost a quarter century of dedicated community service to his community.\n        Harry Douglas was elected Vice-President of the Merrick Boulevard Local Development Corporation at its formation in 1980 and served in that capacity until his death.  He was also instrumental in the organization of the Springfield Gardens Business Merchants Association.  He worked closely with the men and women of the 113th Police Precinct on a regular basis to address the many problems that confronted the community.  Through his leadership, grants for neighborhood improvements were provided by Federal, State and City agencies.  As the architect of Project Lamb, he was responsible for the annual installation of holiday lights on the Merrick Boulevard shopping strip.\n        Through his persistence under the banner of the Merrick Boulevard Local Development Corporation, Harry Douglas won approval for the Locust Manor Civilian Patrol and for the two neighborhood redevelopment contracts awarded to provide security and safety equipment for 46 merchants from Archer Avenue to Springfield Boulevard.\n        As the lead singer of The Deep River Boys, Harry Douglas delighted audiences around the world for more than 30 years.  He was featured on nine albums and many singles released by the group.  The Deep River Boys performed twice at the White House and gave a Command Performance for Her Majesty, the Queen of England\n", "year": "2001"}, {"id": "200126", "coname": "Liberty Pole Boulevard", "location": "84th Street between 16th Avenue and 18th Avenue", "lat": 40.608344, "long": -74.00130899999999, "borough": "Brooklyn", "loc_result": "84th St & 18th Ave, Brooklyn, NY 11214, USA", "postal": "11214", "reason": "This legislation was requested by the Friends of Historic New Utrecht, Inc., to name the street abutting the National Historic Landmark New Utrecht Liberty Pole.  The Liberty Pole has been at this location since November 1783.  It commemorates the evacuation of the British from our shores during the Revolutionary War period and is believed to be the only remaining Liberty Pole of its kind in the United States.  It is intended for the Liberty Pole to be incorporated into the Brooklyn American Revolution Heritage Trail being planned by a number of Brooklyn historical groups.  ", "year": "2001"}, {"id": "200127", "coname": "Sal Candrilli Place", "location": "Joyce Street between Naughton Avenue and Seaver Avenue", "lat": 38.8577287, "long": -77.0632976, "borough": null, "loc_result": "S Joyce St, Arlington, VA, USA", "postal": null, "reason": "Salvatore “Sal” Candrilli was born on May 30, 1923 to Jerome and Theresa Candrilli. He was raised in the Dongan Hills section of Staten Island, attended Public School 11 and graduated from New Dorp High School in 1942. As a child, Mr. Candrilli was always active in sports, playing baseball for New Dorp High School, football in the New Dorp Teens Football League and caddying at the Richmond County Country Club, which brought out his love for golf. \nOn October 22, 1942 Sal Candrilli enlisted in the United States Marine Corps and served as a Combat Engineer in the 2nd Division, seeing action in Spain, the Mariana Islands and Okinawa. He was honorably discharged as a Corporal on December 8, 1945. After his discharge, Sal Candrilli worked for the Great Lakes Dredge and Dock Company and for Local 21, Staten Island before being hired by the New York City Department of Parks, where he retired after 35 years as a Mechanic Foreman in 1985.\nHe met and married, Ethel Young on April 10, 1948 and they had four children, Donald, Richard, Jerome and Missey, which is why his “love affair” of approximately 30 years, with Little League Baseball started.  Sal Candrilli began his Little League “career” as a coach with the Island Chevies. He also served as field Commissioner, umpire, and later, president of the Staten Island Little League in Dongan Hills, for approximately 17 years. He continued for another 13 years as District 24 Administrator for the National Little League Headquarters, overseeing leagues on Staten Island and in Manhattan. During this time he led the fight against a measure that would have taxed Little Leagues for their real estate helping to form the Staten Island Athletic and Recreational Alliance. He also was a pioneer in creating night baseball on Staten Island and a girl’s softball program. A ball field was named for him by the Staten Island Little League. \nIn May of 1973, the Award of Merit was presented to Mr. Candrilli from then Borough President of Richmond, Robert T. Connor. In 1974, while president of the Staten Island Little League, he was profiled in the Staten Island Advance for his work in planning and preparing to host the National Regional Tournament at Hy Turkin field. In 1976, he was honored for “Outstanding Services to Staten Island Sports”, at the 11th annual Advance All-Star Dinner. In 1985 Mr. Candrilli decided to “retire” from Little League Baseball because, as he said,  “times have changed and it’s time for someone else to take over”, but also saying that, “I’ll always be around”.\nOn September 20, 1996 Salvatore Candrilli died. He was survived by his wife, the former Ethel Young; his children, a sister, Ann Pinto, and four grandchildren. His participation in organized sports on Staten Island made a difference for many people, including his grandchildren, Christina and Peter Candrilli and Nicole and Jennifer Vitagliano, who actively play in many organized sports on Staten Island. They have inherited his sportsmanship, respect for others on and off the field, and his true feelings for all kinds of sports, always remembering that he would say “it doesn’t make a difference if you win or lose but it’s how you play the game”. It is therefore fitting that Joyce Street between Naughton Avenue and Seaver Avenue, which abuts the Staten Island Little League complex, be named “Sal Candrilli Place” in his honor.\n", "year": "2001"}, {"id": "200128", "coname": "Leonard Stavisky Place", "location": "29th Road between 137th Street and 138th Street", "lat": 40.7716247, "long": -73.8306044, "borough": "Queens", "loc_result": "29th Rd & 138th St, Queens, NY 11354, USA", "postal": "11354", "reason": "Leonard P. Stavisky was born in New York City and attended New York City public schools.  He earned three university degrees: a Bachelor of Science from City College of New York and both a Master of Arts and Doctor of Philosophy degrees from the Graduate Faculty of Political Science of Columbia University.\n        A university professor by background, Leonard Stavisky had more than 25 years of experience teaching and in administration at Columbia University, the State University of New York, the City University of New York, Colgate University, Long Island University and Virginia Polytechnic Institute.\n        He began his career in public service in City government by serving for seven years as a deputy to the President of the New York City Council.  Between 1972 and 1977, he served as a member of the State Charter Revision Commission for the City of New York.\n        In 1965, Leonard Stavisky was elected to the New York State Assembly where he represented Flushing, Queens and served as the Chairman of the Education Committee for eight years.  He was elected to the New York State Senate in 1983 in a special election.\n        Senator Stavisky served as National Vice-Chairman of the Commission on Organization of the American Jewish Congress, Trustee of the Municipal Lodge of B’nai B’rith, the New York League of Histradrut and the Settlement Housing Fund, Honorary Trustee of the National Amputation Foundation, and as a member of the Board of Directors of Interfaith Movement, Inc.\n        On a more local level, Senator Stavisky served as the Chairman of the Whitestone Library Committee and on the Board of Directors of the Bay Community Volunteer Ambulance Corps, the Latimer Gardens Community Center, the Bland Houses Community Center, the Flushing Boys Club and the North Flushing Senior Center.  He also served on the Advisory Board of the Queens Council On The Arts, the Iris Hill Nursery School and Save The Theatres, Inc. \n        On a citywide level, Senator Stavisky served on the Board of Trustees of the New York Public Library, the Board of the New York City Employees Retirement System, the New York City Health Insurance Board, the Mayor’s Committee on Scholastic Achievement and the Mayor’s Committee on Coordination of Services to Families and Children.\n        Upon his death in 1999, Senator Stavisky was survived by his wife, now State Senator, Toby Ann Stavisky and a son Evan.\n        This street designation is supported by Queens Community Board No. 7, Members of Congress Nita M. Lowey, Gary L. Ackerman and Joseph Crowley, State Senator George Onorato and Assembly Member Nettie Mayersohn\n", "year": "2001"}, {"id": "200129", "coname": "Harold Rapkin Plaza", "location": "the west side of Paulding Avenue at its intersection with the Esplanade", "lat": 40.8664812, "long": -73.8586455, "borough": "Bronx", "loc_result": "Paulding Ave, Bronx, NY, USA", "postal": null, "reason": "Harold Rapkin was born to Nathan and Hattie Rapkin in the Bronx on February 16, 1917. He attended James Monroe High School and went on to attend City College. He met and married his wife Grace in 1944 and they maintained residence in The Bronx until his death. During World War II Harold Rapkin served in the Army Air Force for almost four years.\nIn 1974 Harold and Grace Rapkin moved to Pelham Parkway where they both joined Post #769 of the Jewish War Veterans (JWV). A year later Mr. Rapkin was elected Junior Vice-President of the organization and in 1977 he was elected Commander and was re-elected Commander n 1978. Shortly after joining Post #769, Mr. Rapkin suggested that the organization donate money to the Patrolmen’s Benevolent Association of New York to purchase two bullet-proof vests. This was done at a time when the New York City Police Department did not issue bulletproof vests.\nMr. Rapkin also involved Post #769 in many other projects. In 1977, JWV sponsored the dedication of a ‘Lt. Colonel Yehonatan Netanyahu Lane’, in the Pelham Parkway area, in memory of the Israeli hero who was killed in the Entebbe raid in Uganda. In 1986, the crosswalk at Pelham Parkway South and Muliner Avenue was named the ‘Raoul Wallenberg Lane’ in memory of a Swedish diplomat who saved thousands of Jews from Nazi death camps. In 1995, Mr. Rapkin was the driving force in getting a permanent street sign identifying the corner of Pelham Parkway South and Cruger Avenue as ‘Jewish War Veterans of the USA and Ladies Auxiliary Lane’. Also in 1995, Mr. Rapkin sponsored a sizable donation to the Kingsbridge Veterans Hospital to purchase a V-Tech Computer for disabled veterans in the Spinal Column Ward, and was mainly responsible for the erection of a beautiful monument “In memory of all American Jewish men and women who made the supreme sacrifice in the defense of the USA.” The monument was placed on the front lawn of Bronx House on Pelham Parkway South. Every year, on Veterans Day, memorial services are held at the monument. Mr. Rapkin was equally active throughout his Bronx Community and in the five year period preceding his death spent more than 1100 hours volunteering at the Kingsbridge Veterans Hospital.\nHarold Rapkin received numerous awards for his contributions including: In 1976 he received a “Certificate of Appreciation for Outstanding Community Service” from the Pelham Parkway South Association; also in 1976 he received a plaque from the New York City Police Department 43rd Precinct for “Exceptional Service”; in 1978 he received an “Award of Merit” from Bronx House for “Outstanding Leadership”; In 1981 he received an award from Pelham Parkway Post 796 for “Outstanding and Exemplary Devotion to JWV and Community”. Also in 1981 he received the “Abe Nadelman Award for Outstanding Service” from Post #769 JWV (Mr. Nadelman was their first commander); Mr. Rapkin also received the “Man of the Year” award from the Bronx County Council of JWV; in 1984 he became the first recipient of Post #769’s “Murray Portnoy Memorial Award”; and in 1986 he was the Pelham Parkway Jewish Center’s “Man of the Year”.\nHarold Rapkin died on October 23, 1997. He was survived by his wife, Grace, and a brother, Edwin. For his many years of devoted service to the Bronx Community, it is fitting that the westside of Paulding Avenue at its intersection with the Esplanade, where Harold Rapkin lived for many years, be called Harold Rapkin Plaza in his honor.\n", "year": "2001"}, {"id": "200130", "coname": "DONNA and  MICHELE BLANCHARD PLAZA", "location": "Fort Hamilton Parkway and 92nd Street", "lat": 40.6169514, "long": -74.0274896, "borough": "Brooklyn", "loc_result": "Fort Hamilton Pkwy & 92nd St, Brooklyn, NY 11209, USA", "postal": "11209", "reason": "On June 7, 1994, Donna Blanchard dropped her five-year old son, Andrew, at P.S. 104.  She and her four-year old daughter Michele then went to the local grocery store to pick up a few items.  On their return trip from the grocery store, as they crossed Fort Hamilton Parkway at the corner of 92nd Street, they were both struck and killed by a hit- and-run driver who was never identified. Donna Blanchard was born and raised in Bay Ridge, Brooklyn.  She attended grammar school at St. Patrick’s Church school and went on to attend Fort Hamilton High School.  During her lifetime, Donna Blanchard worked at many local business establishments until her marriage and the birth of her five children.  She dedicated her life to her children and was often seen playing with them in front of the house or at the local park.", "year": "2001"}, {"id": "200131", "coname": "ARTHUR HAYES WAY", "location": "32nd Avenue, between 103rd Street and 104th Street,", "lat": 40.75959410000001, "long": -73.86496439999999, "borough": "Queens", "loc_result": "32nd Ave & 104th St, Queens, NY 11369, USA", "postal": "11369", "reason": "Arthur Hayes was born on January 3, 1923, to Andrew and Lorena Hayes in Port Arthur, Texas. Mr. Hayes, along with his wife Lillian and his daughter Ann, was a long time resident of the East Elmhurst area. He was an active member of Community Board #3, President of the East Elmhurst-Corona Civic Association, Inc., First Vice-President of the Jackson Heights Development Corporation, a Board Member of the Jerome Hardeman Day Care Center and Worshipful Master of Trinity Lodge No.51 in East Elmhurst. Mr. Hayes was also involved with many other community organizations and activities.\nAs President of the East Elmhurst-Corona Civic Association, Arthur Hayes worked diligently to resolve quality of life and as a Community Board Member, Mr. Hayes served on the Transportation, Land Use and other committees, and was instrumental in obtaining approval to make 32nd Avenue a one-way street because of the heavy traffic. As a member of the Transportation Committee, Mr. Hayes attended numerous meetings with the Port of Authority of New York and New Jersey regarding the AGT Monorail, the “Flyover Project” at LaGuardia Airport, and other safety issues at the airport due to its close proximity to the East Elmhurst community. He was also involved in environmental issues such as the dredging and clean-up of Flushing Bay.\nArthur Hayes was the recipient of numerous awards for his community service. He received the Elmcor Youth and Adult Activities, Inc. “Hall of Fame Award” in 1981; was an honoree of the Key Women of America, Inc. Concourse Village Branch, in 1989; was an honoree of the North Shore National Association of Negro Business and Professional Women in 1991; was honored by the Black American Heritage Foundation in 1994; received the Corona Congressional Church’s “Community Service Award” in 1994; was honored by the Jackson Heights Community Development Corporation in 1995; and, was a 115th Police Precinct Community Service Honoree in 1996. Mr. Hayes received Citations of Honor from Queens Borough President Claire Shulman and the New York City Council in 1995.\nArthur Hayes died on April 1, 1997. He was survived by his wife, Lillian, a daughter, Ann, and a sister, Myrtle Stuckey. ", "year": "2001"}, {"id": "200132", "coname": "JOHN DOWNING PARK", "location": "park at 50th Street and 43th Avenue", "lat": 40.7444842, "long": -73.9146404, "borough": "Queens", "loc_result": "43rd Ave & 50th St, Queens, NY 11377, USA", "postal": "11377", "reason": "John Downing, 40 years of age, was one of three firefighters who died and 50 others who were injured in a Father’s Day fire in Astoria, Queens on June 17, 2001.  Survived by his wife Anne and children Joanne, age 7, and Michael, age 3, John Downing had an extended family that ranged from Queens County to Ireland.  An eleven year Fire Department veteran, at the time of his tragic death he was assigned to Ladder Company 163.  ", "year": "2001"}, {"id": "200133", "coname": "TEDDY WHITE PLACE", "location": "57th Street between 30th Avenue and 31st Avenue", "lat": 40.7572344, "long": -73.9048238, "borough": "Queens", "loc_result": "31st Ave & 57th St, Queens, NY 11377, USA", "postal": "11377", "reason": "Teddy White was born on July 25, 1971 to Edward and Regina White, in Boulevard Gardens in Woodside, Queens. His family grew to include brothers Jimmy, Chris and Billy, and a sister, Sue. Teddy attended kindergarten at Public School 151 and then went to the Corpus Christi School for eight years. After grammar school he continued at Monsignor McClancy High School from which he graduated in 1989.\nOn April 18, 1998 Teddy White married his lovely wife Jennifer, and a daughter, Taylor, was born to the couple on December 16, 1999. The young family bought an apartment at Boulevard Gardens and settled there. Mr. White joined the New York City Fire Department and was assigned to Engine Company 230 in Brooklyn.\nOn September 11, 2001 Teddy White and the members of Engine Company 230 responded to the emergency brought on by the attacks on the World Trade Center. Mr. White died while attempting to save lives when the twin towers collapsed. He was survived by his wife, Jennifer, his daughter, Taylor, his parents, Edward and Regina, and four siblings.\n", "year": "2001"}, {"id": "200134", "coname": "LAWRENCE VIRGILLIO PLAYGROUND", "location": "Windmuller Park, 52nd Street and 39th Drive", "lat": 40.74742579999999, "long": -73.910292, "borough": "Queens", "loc_result": "Windmuller Park, 39th Rd, Queens, NY 11377, USA", "postal": "11377", "reason": "911 heroes", "year": "2001"}, {"id": "200135", "coname": "BOULEVARD OF BRAVERY", "location": "Queens Boulevard between 63rd Street6 and 65th Place ", "lat": 40.74074830000001, "long": -73.8996591, "borough": "Queens", "loc_result": "Queens Blvd & 65th Pl, Queens, NY 11377, USA", "postal": "11377", "reason": "This proposal is intended to honor the members of New York Fire Department Special Unit Rescue Company 4 located at 64-18 Queens Boulevard.  This unit was one of the first to respond to the terrorist attacks at the World Trade Center on September 11th.  It is also the unit that suffered some of the greatest losses in the City.  Seven members of Rescue 4 perished in the collapse of the Twin Towers.  That portion of Queens Boulevard that is located outside of Rescue 4 would be designated as the Boulevard of Bravery.", "year": "2001"}, {"id": "200136", "coname": "PLAZA OF HEROES", "location": "Perry Avenue and 68th Street", "lat": 40.7261215, "long": -73.8965374, "borough": "Queens", "loc_result": "68th St & Perry Ave, Queens, NY 11378, USA", "postal": "11378", "reason": "This proposal is intended to honor the members of Squad 288, Hazmat 1, located at 56-29 68th Street in Queens.  This unit was one of the first to respond to the terrorist attacks at the World Trade Center on September 11th.  It is also the unit that suffered some of the greatest losses in the City.  Eleven members of Hazmat 1 perished in the collapse of the Twin Towers.  An intersection outside Hazmat 1, Perry Avenue and 68th Street, would be designated as the Plaza of Heroes.", "year": "2001"}, {"id": "200137", "coname": "KEVIN F. CONROY Ballfield at Greenwood Playground", "location": "playground at East 5th Street between Greenwood Avenue and Fort Hamilton Parkway", "lat": 40.6332646, "long": -74.0052219, "borough": "Brooklyn", "loc_result": "Fort Hamilton Pkwy, Brooklyn, NY, USA", "postal": null, "reason": "Kevin Francis Conroy was a lifetime resident of the Kensington section of Brooklyn.  He gave extensively of his time and energy to projects to better the community and was particularly dedicated to providing recreational opportunities to the youth of the community.\nKevin Conroy was a youth mentor and role model to both the young men and young women who played in the basketball and softball programs of which he was a part.  With his wife, Georgette, Kevin Conroy had four children, three girls and one boy. He was also an active member of the Immaculate Heart of Mary Parish.\n        At the time of his death, at the age of 47, during the terrorist attack on September 11, 2001, Kevin Conroy was employed as a Vice-President of Corporate Accounting with the firm of Marsh &  McLennan at the World Trade Center.\n        The ballfield proposed to be named herein was the location where he regularly played in a community softball league.\n", "year": "2001"}, {"id": "200138", "coname": "FATHER JOSEPH DAVID COLBERT", "location": "St. Pancras Church, 68th Street", "lat": 40.70080249999999, "long": -73.8841604, "borough": "Queens", "loc_result": "72-22 68th St, Queens, NY 11385, USA", "postal": "11385", "reason": "Father Joseph David Colbert was born in Brooklyn, New York on August 19, 1933 to Joseph and Abigail (McCarthy) Colbert.  He was baptized in the Church of Saints Peter and Paul and was educated at St. Francis of Assisi School, Cathedral High School/College and the Seminary of the Immaculate Conception (Huntington, New York).  Father Colbert was ordained on May 30, 1959 at St. James Pro Cathedral in Brooklyn.  \n        Following his ordination, Father Colbert ministered to the people of the Diocese as an Associate Pastor at St. Mel’s Parish in Whitestone, New York, as an Associate Pastor and, later, as Pastor at St. Pascal Baylon Parish in St. Albans, New York and as Pastor at St. Pancras Parish in Glendale, New York.   \n        Father Colbert led the restoration of St. Pancras Church, improved the grounds and maintained and improved St. Pancras School.  He made St. Pancras “the showcase of the eastern seaboard”.  He loved being present at school assemblies, class masses, students’ day programs and graduations.  He always stressed to the students that they do all with “grace, dignity and poise”.  \n        Father Colbert was also a lover of the arts and he incorporated this love into his life and his homilies.  He approached all that he did with vigor, energy and pride.\n", "year": "2001"}, {"id": "200139", "coname": "FIREFIGHTER CHRISTOPHER J. SIEDENBERG ", "location": "Evergreen Park, Staten Island", "lat": 40.5795317, "long": -74.1502007, "borough": "Staten Island", "loc_result": "Staten Island, NY, USA", "postal": null, "reason": "A lifelong resident of the Great Kills section of Staten Island, Christopher J. Siedenberg was one of three firefighters who died in the line of duty fighting a blaze in lower Manhattan in March 1994.  While growing up on Staten Island, Christopher Siedenberg’s oft-stated ambition was to become a fireman.  Prior to joining the New York City Fire Department, Christopher Siedenberg was certified as a New York State Emergency Medical Technician.  He joined the Volunteer Heart Resuscitation Unit of Staten Island and continued to volunteer there even after being appointed to the Fire Department in 1991.\n        Evergreen Park is located directly behind Christopher Siedenberg’s boyhood home.  He spent many enjoyable hours in that park when he was growing up.  It is for that reason that Evergreen Park is to be renamed in his memory.\n", "year": "2001"}, {"id": "200140", "coname": "Ilka Tanya Payan Memorial Park", "location": "an existing park located on West 156th Street, between Riverside Drive and Broadway", "lat": 40.8333215, "long": -73.945044, "borough": "Manhattan", "loc_result": "W 156th St, New York, NY 10032, USA", "postal": "10032", "reason": "Ilka Tanya Payan was born on January 7, 1943 in Santo Domingo, Dominican Republic. She died of complications due to AIDS on April 6, 1996 in New York City at the age of 53. Ms. Payan was famous for her portrayal of the villainous Carmen Delia on the Spanish-language television soap opera “Angelica, Mi Vida” and as a champion for anti-AIDS causes.\nLong before Ms. Payan became an AIDS activist, she was active in the Latino community providing information about immigration issues.  She went to law school, was admitted to the bar in 1981, and went on to practice immigration law. She also became a contributing columnist for El Diario-La Prensa, the largest circulation Spanish-language newspaper in New York.\n        In 1986, Ilka Tanya Payan discovered that she was HIV positive. Fearing being stigmatized, she kept her condition secret for seven years. In 1993, she shocked the Latin-American community by publicly disclosing her situation and becoming actively involved in AIDS-related causes. She devoted herself to enlightening her community regarding AIDS and received a number of awards for her work. In recognition of her courage, her dignity and her outstanding passion for educating the public to the grim realities of AIDS, it is fitting that an existing park located on West 156th Street, between Riverside Drive and Broadway, in the community where she lived for many years, be named, “Ilka Tanya Payan Memorial Park” in her honor.\n", "year": "2001"}, {"id": "200141", "coname": "Juan Pablo Duarte Square", "location": "West 170th Street, between Saint Nicholas Avenue and Broadway", "lat": 40.84175640000001, "long": -73.9392596, "borough": "Manhattan", "loc_result": "Broadway & St Nicholas Ave, New York, NY 10032, USA", "postal": "10032", "reason": "Juan Pablo Duarte, born in the city of Santo Domingo on January 26, 1813, is considered the “Founding Father of the Dominican Republic”. He was the son of a Spanish merchant and, as a teenager, he was sent to Spain to continue his studies. During this time he was greatly influenced by Catalonia’s “autonomous community” goals. When he returned to Santo Domingo in 1838, he found that young Dominicans were resentful of Haitian rule. The Haitian domination of eastern portion of the island of Hispaniola had begun in 1822. The political unification of Hispaniola brought liberation to the slaves, land reforms, and political rights for all the people living on the eastern part of the island. Haitian domination made the Dominican people recognize the importance of self-government and political participation. Haitian law recognized political participation but Dominicans were actually considered a minority with few rights.\nIs was in this atmosphere that Juan Pablo Duarte created a secret society, called “La Trinitaria”, in 1838 so that the yearning for liberty and self-government could be further intensified. He developed a political underground movement that organized the youth of the most important cities of the eastern part of Hispaniola. To promote their goals they used flyers, “cantaletas” (serenades with songs that had political content), and presented dramas with political content through a cultural organization called “La Filantropica”. This organization was open to all, promoted cultural activities and was controlled by “La Trinitaria”. In 1843, La Trinitaria worked together with the “Reformista” movement from the western part of the island to overthrow Jean Pierre Boyer’s Regime. Though this did not end Haitian rule, the situation made it possible for the La Trinitaria movement to gain political strength and to work in the open during elections.\nCharles Herard, the leader of the Reformista movement and successor to Boyer, understood and mistrusted the political goals of the Trinitaria. After he was elected president in 1843 Herard persecuted the “La Trinitaria” movement and Duarte was forced to escape to Curacaco while his closest collaborators went into hiding. However, the movement toward independence continued to grow even with Duarte in exile. On February 27, 1844 the forces for independence issued a proclamation declaring the freedom of the Dominican Republic. Duarte returned and he immediately took charge of the army. This situation was short lived, however, for another political group that also promoted annexation took over the government and jailed Duarte. He was sent into exile within a year.\nDuarte retired to an isolated village in Venezuela and remained away from his country for twenty years. In 1861, Spain took over the Dominican Republic and made it a colony. War broke out in 1863 against Spanish rule and Duarte returned the following year to fight again for Dominican Independence. He was sent on a diplomatic mission by the provisional Dominican government to solicit funding for the war from neighboring countries. After independence was reestablished he returned to Venezuela. He died there in 1876, having devoted his entire life to the independence of the Dominican Republic. In recognition of his leadership in the independence movement of his country it is fitting that the northern side of West 170th Street, between Saint Nicholas Avenue and Broadway, in the heart of one of New York’s largest Dominican communities, be called “Juan Pablo Duarte Square.”  The naming of this “Square”, located at the end of the previously named “Juan Pablo Duarte Boulevard”, will provide space to erect a monument to Duarte as a symbol of  “democracy and freedom”.\n", "year": "2001"}, {"id": "200142", "coname": "Met Life Plaza", "location": "Bridge Plaza North, between 27th Street and 28th Street", "lat": 40.8555829, "long": -73.9687643, "borough": null, "loc_result": "Bridge Plaza N, Fort Lee, NJ 07024, USA", "postal": "07024", "reason": "The Metropolitan Life Insurance Company is consolidating and relocating a substantial portion of its New York City operations from its space at One Madison Avenue in Manhattan to Long Island City.  At least 800 Met Life employees are now in the process of being relocated to this new Long Island City location. There is a possibility of another 1,000 employees being assigned to the immediate area if a requested zoning change in enacted. Along with a zoning change, Met Life has requested and received, from the United States Postal Service, an address designation as “One Met Life Plaza.” This legislation seeks to give dual designation status to the area of Bridge Plaza North, between 27th Street and 28th Street, the area in front of the new Met Life offices, as “Met Life Plaza”.", "year": "2001"}, {"id": "200143", "coname": "Vernon Cherry Way", "location": "Broadway between 48th Street and 51st Street", "lat": 40.7620801, "long": -73.98365179999999, "borough": "Manhattan", "loc_result": "Broadway & W 51st St, New York, NY 10019, USA", "postal": "10019", "reason": "Vernon Cherry served the City of New York as a firefighter at Ladder Company No. 118.  Born and raised in Woodside, Queens, Vernon Cherry enjoyed a distinguished 28-year career as a firefighter.  He was also well known for his outstanding singing voice, which he often used in support of charitable causes.  On September 11th Vernon Cherry answered the call at the World Trade Center and perished, at the age of 49, in the collapse of the twin towers.  ", "year": "2001"}, {"id": "200144", "coname": "Michael Brennan Way", "location": "41th Street between 50th Avenue and the Brooklyn Queens Expressway", "lat": 40.6788705, "long": -73.9511887, "borough": "Brooklyn", "loc_result": "1199 Atlantic Ave, Brooklyn, NY 11216, USA", "postal": "11216", "reason": "Michael Brennan was a lifelong resident of the Sunnyside section of Queens.  He was employed as a New York City firefighter assigned to Ladder Company No. 4 in Manhattan. On September 11th Michael Brennan answered the call at the World Trade Center and perished  in the collapse of the twin towers.  ", "year": "2001"}, {"id": "200145", "coname": "The Street of Arts & Culture", "location": "Rockwell Place, between Lafayette Avenue and DeKalb Avenue", "lat": 40.6890441, "long": -73.979298, "borough": "Brooklyn", "loc_result": "31 Rockwell Pl, Brooklyn, NY 11217, USA", "postal": "11217", "reason": "The Rockwell Place area has always been a mecca of cultural programs.  Recently, this mecca has been enhanced by the addition of the 651 Arts Group and the Mark Morris Dance Group.  The Mark Morris Dance Group has built an entire building from the ground up to house their internationally known troupe.  In order to welcome these two additions to the community, and encourage other cultural programs to join them, Rockwell Place, between Lafayette Avenue and DeKalb Avenue, is proposed to be co-named The Street of Arts & Culture.", "year": "2001"}, {"id": "200146", "coname": "Battalion Chief Robert Turner Way", "location": "Hancock Street, between Stuyvesant Avenue and Marcy Avenue", "lat": 40.682914, "long": -73.946727, "borough": "Brooklyn", "loc_result": "Hancock St & Marcy Ave, Brooklyn, NY 11216, USA", "postal": "11216", "reason": "Robert Roland Turner was born on January 18, 1932 to Vivian McCoy and George Turner in Brooklyn, New York. He was baptized at the Bridge Street A.M.E. Church where he remained a member throughout his life. Mr. Turner attended local public schools and graduated from Franklin K. Lane High School. He attended Brooklyn College and later completed his studies at Lincoln University, for which he received a Masters of Human Services Degree in 1991.\nIn 1951, Robert Turner joined the New York National Guard where he attained the rank of Sergeant and he joined the New York City Fire Department (FDNY) in 1955. During his career at FDNY he served in many positions, including Deputy Commissioner for Community Affairs, before ascending to the rank of Battalion Chief. Of his many accomplishments at FDNY he was duly proud of his role in expanding the participation of African-Americans and Women. \nIn his local community, Mr. Turner worked diligently to improve the quality of life. He was affiliated with Cub Scout Pack 259 of the Bridge A.M.E. Church, was very active in his Block Association and in local political and civic organizations. He served as County Committee Member of the New York State Democratic Party, Campaign Manager for New York City Council Member Annette M. Robinson, President of the Vulcan Society, as a Board Member of the International Association of Black Professional Firefighters and as a member of the Lions Club.\nRobert Turner was married from 1954 to 1973 to Barbara Lashley. This union produced two children, a daughter, Renee Vanessa, and a son, Robert Roland Turner II.  In 1974 Mr. Turner married Vonceil Watson. This marriage lasted until 1994.\nRobert Turner died on January 9, 1997. He was survived by his children; three grandchildren, Andre Terrence Moore, Robert Roland Turner III, and Monique Nicole Turner, a brother, George J. Turner, and a sister, Vivian R. Armfield. In recognition of his service to his community and the City of New York, it is fitting that Hancock Street, between Stuyvesant Avenue and Marcy Avenue, the site of Fire Engine Company No. 214 where Mr. Turner served for several years, be named in his honor.\n", "year": "2001"}, {"id": "200620061", "coname": "Actors' Equity Corner", "location": "Northeast corner of 46th Street and 7th Avenue", "lat": 40.7585917, "long": -73.98507959999999, "borough": "Manhattan", "loc_result": "7th Ave & W 46th St, New York, NY 10036, USA", "postal": "10036", "reason": "The Actors’ Equity Association represents over 45,000 actors and stage manager in the United States. For 90 years, it has negotiated wages and working conditions providing a wide range of benefits including health and pension plans. It promotes and fosters the art of live theater as an essential part of our cultural life.", "year": "2006"}, {"id": "200620062", "coname": "Josephine Diana Blvd", "location": "17th Avenue and 72nd Street", "lat": 40.6165463, "long": -73.9965895, "borough": "Brooklyn", "loc_result": "17th Ave & 72nd St, Brooklyn, NY 11204, USA", "postal": "11204", "reason": "Josephine Diana migrated to the United States with her parents in 1955 and settled in Bensonhurst, Brooklyn. She married and had three children, all of whom attended Our Lady of Guadalupe School where Josephine was an active parent and volunteer all through her children’s education. Josephine really epitomized a community minded person by helping her neighbors at time of need and always assisting when something happened in her community.", "year": "2006"}, {"id": "200620062", "coname": "Rev. Msgr. Bryan J. Karvelis Way", "location": "Marcy Avenue Between Hewes and Hooper Streets", "lat": 40.705439, "long": -73.95633699999999, "borough": "Brooklyn", "loc_result": "Hooper St & Marcy Ave, Brooklyn, NY 11211, USA", "postal": "11211", "reason": "Rev. Bryan J. Karvelis led the Parish of the Transfiguration and was a consummate pillar of the community who dedicated his life improving the neighborhood in a variety of ways. From his work in founding the Southside Mission to his help in opening Casa Betsaida, a residence for people in the community who are infected with the AIDS virus, Rev. Karvelis uplifted his parish by making sure residents had access to the services they needed. His effort and leadership strengthened the community.", "year": "2006"}, {"id": "200620062", "coname": "Sgt. Jose Gomez Place", "location": "104th Street Between 37th and 38th Avenues", "lat": 40.751448, "long": -73.86251399999999, "borough": "Queens", "loc_result": "38th Ave & 104th St, Queens, NY 11368, USA", "postal": "11368", "reason": "Sgt. Jose Gomez is a local hero. He gave his life for his country in Iraq on April 27, 2006, in a roadside bombing in Iraq. He was three months into his second tour of duty in Iraq with the 10th Calvary, 4th Brigade, 4th Infantry Division. According to Maj. Gen. Bill Grisoli, Sergeant Gomez moved his vehicle forward after an explosion to save and protect his fellow soldiers in the convoy. He received a purple heart and bronze star in honor of his heroic efforts. Sgt. Jose Gomez was born in the Dominican Republic and came to Corona, Queens at the age of three. His dream was to go to college and study mathematics to become an accountant.", "year": "2006"}, {"id": "200620062", "coname": "Dr. Reverend Wyatt Tee Walker Square", "location": "West 116th Street and Adam Clayton Powell, Jr. Boulevard", "lat": 40.8032027, "long": -73.9524498, "borough": "Manhattan", "loc_result": "Adam Clayton Powell Jr Blvd & W 116th St, New York, NY 10026, USA", "postal": "10026", "reason": "Dr. Reverend Wyatt Tee Walker was born in 1929 in Brockton, Massachusetts and later earned his bachelor’s degree in 1950 from Virginia Union University in Richmond, Virginia. It was through his enrollment there that he met Dr. Martin Luther King Jr. and they attended the Crozer Theological Seminary together.\n        In 1960, Rev. Walker was appointed as the Executive Director of the Southern Christian Leadership Conference (SCLC). It was under the leadership of Walker that SCLC became a major national factor in the Civil Rights Movement. Rev. Walker is also responsible for $100 million in housing construction, as Chairman of the Consortium for Harlem Development. In addition to his pastoral duties, Rev. Walker was able to complete his doctoral dissertation, receiving his PhD. from Colgate Rochester Divinity School in 1975. \nDr. Reverend Wyatt Tee Walker was named one of the greatest African-American preachers in the nation, named by an Ebony Magazine poll in 1993. He is an author of twenty-one books, including Common Thieves and the Harvard Paper. Even today, the Canaan Baptist remains involved in the advocacy of senior citizens, housing and drug rehabilitation programs. \n", "year": "2006"}, {"id": "201320131", "coname": "Hermena Rowe Street", "location": "the southwest corner of Adam Clayton Powell, Jr. Boulevard and 122nd Street", "lat": 40.8070199, "long": -73.9496581, "borough": "Manhattan", "loc_result": "W 122nd St & Adam Clayton Powell Jr Blvd, New York, NY 10027, USA", "postal": "10027", "reason": "Hermena Rowe (1929 – 2005), was a resident of Harlem for 62 years.  She was born December 29, 1929 in Bamberg, South Carolina and moved to New York City at the age of 14 and began attending public schools, where she graduated from Washington Irving High School. In 1946, she married the late Clarence Rowe and had a family of nine children.  As a concerned parent, Ms. Rowe became engaged as a community activist in order to bring about much needed improvements in conditions in her children’s’ schools.  In the late 1950’s and early 1960’s Ms. Rowe served as Secretary of the PS 144 Parent-Teacher Association (PTA) and became an active member of the Wadleigh Junior High School PTA where she was integral in planning and implementing innovative programs, as well as in selecting qualified educators and administrators.  Through her work as a community activist, Ms. Rowe collaborated with such leaders as Ennis Francis, Bernice Bolar, Bea Ellis, Vivian Waller, Noreen Clark and Percy Sutton and helped to bring about positive changes to the social and political climate of the community.  Ms. Rowe also worked for a time at the Center for Early Childhood Program and with the East Harlem Scholarship Program, where she was instrumental in awarding scholarships to many deserving minority college students.  Ms. Rowe also served as a member of several Harlem Community organizations, including Harlem Youth Opportunities Unlimited (HARYOU-ACT), Neighborhood Board #4, Planning Board #10, The Board of Family Planning and Addicts Rehabilitation Center (ARC).  Ms. Rowe was also a devoted and active member of Christian Parish for Spiritual Renewal since 1955. ", "year": "2013"}, {"id": "201320132", "coname": "Captain Dennis Morales Way", "location": "At the intersection of 4th Avenue and 36th Street", "lat": 40.6542745, "long": -74.0043499, "borough": "Brooklyn", "loc_result": "4th Ave & 36th St, Brooklyn, NY 11232, USA", "postal": "11232", "reason": "Captain Dennis Morales joined the New York City Police Department in January 1992, where he began his career on patrol in the 7th Precinct. He was promoted to Sergeant in 1997, Lieutenant in August 2000 and Captain in March 2004. His career spanned 18 years during which time, he graduated from St. Joseph’s College, made 93 arrests, was recognized six times for Excellent Police Duty and two times for Meritorious Police Duty. As part of the Emergency Service Unit, he participated in rescue and recovery efforts following the 9/11 terrorist attacks. He retired on July 30, 2010 and died on July 2012 at the age of 50 from illnesses contracted from rescue and recovery work performed at the World Trade Center site.", "year": "2013"}, {"id": "201320133", "coname": "Subhi Widdi Way", "location": "At the intersection of 6th Avenue and 56th Street", "lat": 40.7636527, "long": -73.9776904, "borough": "Manhattan", "loc_result": "6th Ave & W 56th St, New York, NY 10019, USA", "postal": "10019", "reason": "Subhi Widdi was born in Jerusalem on January 5, 1933.  Though he dropped out of school due to poverty, he began working in construction at age 16.  Through his construction work, he learned the skills necessary to becoming an architect.  He then started his own company and built many buildings in Jerusalem and nearby towns.  He immigrated to the United States in 1960 where he went into the food business, eventually establishing Widdi Catering Hall in Sunset Park.  He provided use of the hall, free of charge, to non-profit organizations such as local churches, synagogues, mosques and schools and oftentimes forgave the debts of those who could not afford to pay the entire cost for events at the Hall.  Subhi Widdi earned a reputation in his community for being extremely charitable and helpful to anyone who was in need.  He helped fund the construction of the Saint Nicholas Home for the Aged, where he sat as a board member and also founded the New York Chapter of The Red Crescent and was one of the founders of the Arab American Association of New York.  He received numerous accolades throughout his life, including the “Merchant of the Year” award from White Rose Food, and being honored numerous times by the 77th Precinct Community Council for his contributions to the community and being honored by the Tri State Arab American Association of Architects and Engineers in 2010.  ", "year": "2013"}, {"id": "201320134", "coname": "Pat Jones Way", "location": "144th Street Between Hamilton Terrace and Convent Avenue", "lat": 40.8239933, "long": -73.9467293, "borough": "Manhattan", "loc_result": "Convent Ave & W 144th St, New York, NY 10031, USA", "postal": "10031", "reason": "Pat Jones joined Community Board 9 in 2001 and served as chair for two terms from 2008 to 2010.  She co-authored the Community Benefits Agreement, a legal document outlining $76 million in funding and benefits for the neighborhood from Columbia University, and chaired the board committee whose work led to the plan.  She advocated for an alternative to the University’s plan, which included more affordable housing, landmark preservation, and increased accessibility to University facilities.  She also served on the board of the West Harlem Development Corporation.  After serving as CB9 chair, she served as co-chair of the board’s land use and zoning committee.  Throughout her tenure as board and committee chair, she had an instrumental role in several local rezoning efforts, including the Manhattanville and West Harlem rezonings. ", "year": "2013"}, {"id": "201320135", "coname": "Ariel Russo Place (4 Years Old)", "location": "West 97th Street Between Amsterdam Avenue and Broadway", "lat": 40.7953813, "long": -73.97140619999999, "borough": "Manhattan", "loc_result": "Broadway & W 97th St, New York, NY 10025, USA", "postal": "10025", "reason": "Ariel Russo was 4 years-old when she was killed on a sidewalk in June 2013 when an unlicensed teen driver in an SUV jumped the curb while fleeing from the police and struck her.  Records indicated that there was a four-minute delay between the time EMS received the 9-1-1 call and the time an ambulance was dispatched. In response to her death, the City Council passed the Ariel Russo Emergency 9-1-1 Response Time Reporting Act, which requires the Fire Department to count and report complete response times starting from the moment a 911 call is taken, rather than when a vehicle is dispatched in order to help best determine how to best deploy limited resources and facilitate swift emergency response.", "year": "2013"}, {"id": "201320136", "coname": "John E. Nikas Way", "location": "At the intersection of East 12th Street and Gravesend Neck Road", "lat": 40.5945792, "long": -73.959467, "borough": "Brooklyn", "loc_result": "Gravesend Neck Rd & E 12th St, Brooklyn, NY 11229, USA", "postal": "11229", "reason": "John Nikas worked for New York State for a number of years.  He was very involved with the Three Hierarchs Greek Orthodox Church where he helped set up a youth program under the auspices of HANAC, a Hellenic Greek organization which oversaw its operations.  He helped found the 61st Precinct Youth Council, which helped to bring troubled youth into programs working with the NYPD.  The Youth Council flourished and eventually became self-sustaining operation under the name Youth Dares which helped young kids.  He later represented the 61st Precincts new program called The Citizens’ Police Academy.  He was a graduate of the programs first class.  He was a member of the Board of Directors of Community Hospital no known as New York Community Hospital.  He was also the chairperson of Planning Board No. 15 for many years.  ", "year": "2013"}, {"id": "201820181", "coname": "Jean-Jacques Dessalines Boulevard", "location": "Rogers Avenue Between Farragut Road and Eastern Parkway", "lat": 40.670219, "long": -73.95325509999999, "borough": "Brooklyn", "loc_result": "Eastern Pkwy & Rogers Ave, Brooklyn, NY 11216, USA", "postal": "11216", "reason": "Jean-Jacques Dessalines is one of the founding fathers of Haiti, having taken charge of the Haitian Revolution to victory in defeating the French Napoleon Army in 1804.  Significant to world history, the Haitian Revolution is not only the first and only successful slave revolution in the Americas, but also resulted in Haiti being the first Latin American country and second in the Western Hemisphere to declare its independence, after the United States declared independence from Britain in 1776.   Furthermore, the Haitian Revolution was inspirational and gave support to the enslaved and subjugated peoples throughout the world.  More significantly, the Haitian Revolution was a truly transcultural event, joining three interlocking and intersectional 18th Century struggles, which continue to reverberate to the present:  the challenge to imperial European authority; the fight for racial equality and the movement to end to slavery.  Jean-Jacques Dessalines was born into slavery in the French colony of Saint-Domingue. In 1791, he joined the fight for freedom when thousands of brutally exploited enslaved people rose up against their colonial masters, and their enablers in France, who murdered and massacred hundreds of thousands of people across the Caribbean.  By 1793, he was fighting under General Toussaint Louverture, earning the nickname “the Tiger” for his intensity in battle and his military skill. Within a few years, the slave insurgents forced the French administrators of the colony to emancipate them, a decision ratified by revolutionary Paris in 1794.  From 1794 through 1802, Dessalines fought with Louverture both for and against France for the eradication of slavery and the self-determination of the people of Saint-Domingue.  \nAfter Louverture was kidnapped, shackled and deported to France in 1802, Dessalines led the Revolution, as Napoleon appointed General Rochambeau to lead the French military expedition to re-conquer Saint-Domingue.  Rochambeau immediately embarked on a massacre of much of the non-white civilians, including women and children, and military population by staging mass executions via firing squads, hanging and drowning.  By January 1, 1804, the French were defeated and Dessalines declared Haiti independent. Between February and April 1804, Dessalines, in response to French brutality and out of fear of future French re-conquest and re-enslavement ordered the execution of all the remaining white French on the island, estimated in the range of 3,000 to 5,000, but personally protected whites loyal to Haitian independence, including thousands of Polish soldiers who had defected from the French Army. The Haitian Revolution (1791-1804) became the first slave revolt in modern history to result in an independent nation.\nThe independence of Haiti reshaped the Atlantic world by leading to the French sale of Louisiana to the United States, and encouraged republican revolutions in Latin America, and eventually Africa.  Under Petion, Haiti provided direct assistance to Simon Bolivar on at least two crucial occasions during the latter’s successful efforts to secure independence for the Spanish Colonial territories throughout Latin America.  Dessalines was declared Emperor of Haiti in September 1804. Many of the policies he implemented were progressive even by today’s standards, including social policies, such as freedom of religion, equal rights for children born out of wedlock, marriage and divorce laws favorable to women.  Dessalines also attempted land reforms, and specifically policies to address the concentration of ownership of valuable plantations throughout the country by a few wealthy families, which likely led to his death in a roadside ambush on October 17, 1806, when those who opposed his economic policies rebelled and took up arms against him.  Jean-Jacques Dessalines remains a popular symbol of Haitian nationalism. The first capital of independent Haiti was renamed “Dessalines”; the national anthem of Haiti is named after him (“La Dessalinienne”); and his image appears on the 250 Haitian gourde note.\n", "year": "2018"}]